; domain
(define (domain dungeon)

;;(:requirements :strips :typing :conditional-effects :negative-preconditions :equality)

(:types
    hero
    sword
    monster
    trap
    room
)

(:predicates

    (hero-in-room ?h - hero ?r - room) ; is the hero in room ?
    (hero-empty-handed ?h - hero) ; is the hero empty-handed ? i.e. does he not have a sword ?
    (hero-alive ?h - hero) ; is the hero alive ?

    (sword-in-room ?s - sword ?r - room) ; is there a sword in room ?
    (sword-destroyed ?s - sword) ; has the sword been destroyed ?
    (sword-holding ?h - hero ?x - sword) ; is the hero holding the sword ?

    (monster-in-room ?m - monster ?r - room) ; is there a monster in room ?
    (monster-afraid ?h - hero ?m - monster) ; is monster afraid of hero ? (yes if hero holds a sword)

    (trap-in-room ?t - trap ?r - room) ; is there a trap in the room ?
    (trap-armed ?t - trap ?r - room) ; is the trap armed ?
    (trap-disarmed ?t - trap ?r - room) ; is the trap disarmed ?

    (room-destroyed ?r - room) ; is the room destroyed ?
    (room-cleared ?h - hero ?r - room) ; has the room being cleared ? (i.e. no monsters, all traps disarmed)
    (room-corridor ?c ?r - room) ; is there a corridor to an adjacent room ?

)

;; Hero actions

(:action move
    :parameters (?h - hero ?from - room ?to - room)
    :precondition (and
        (not (room-destroyed ?to)) 
        (hero-in-room ?h ?from)
        (hero-alive ?h)
        (room-corridor ?from ?to)
        (room-cleared ?h ?from)
    )
    :effect (and 
        (hero-alive ?h)
        (hero-in-room ?h ?to)
        (not (hero-in-room ?h ?from))
        (room-destroyed ?from)
    )
)

(:action pickup-sword
    :parameters (?r - room ?h - hero ?s - sword)
    :precondition (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (hero-empty-handed ?h)
        (sword-in-room ?s ?r)
        (not ( sword-holding ?h ?s))
    )
    :effect (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (not (hero-empty-handed ?h))
        (not ( sword-in-room ?s ?r ))
        (not ( sword-destroyed ?s ))
        (sword-holding ?h ?s)
        (room-cleared ?h ?r)
    )
)

(:action destroy-sword
    :parameters (?h - hero ?s - sword)
    :precondition (and
        (hero-alive ?h)
        (sword-holding ?h ?s)
    )
    :effect (and
        (hero-alive ?h)
        (sword-destroyed ?s)
        (hero-empty-handed ?h )
    )
)

(:action disarm-trap
    :parameters (?h - hero ?r - room ?t - trap)
    :precondition (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (hero-empty-handed ?h)
        (trap-in-room ?t ?r)
        (trap-armed ?t ?r)
        (not (trap-disarmed ?t ?r))
    )
    :effect (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (hero-empty-handed ?h)
        (trap-in-room ?t ?r)
        (not (trap-armed ?t ?r))
        (trap-disarmed ?t ?r)
        (room-cleared ?h ?r)
    )
)

(:action face-monster
    :parameters (?h - hero ?s - sword ?r - room ?m - monster)
    :precondition (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (sword-holding ?h ?s)
        (monster-in-room ?m ?r)
        (not (monster-afraid ?h ?m))
    )
    :effect (and
        (hero-alive ?h)
        (hero-in-room ?h ?r)
        (sword-holding ?h ?s)
        (monster-in-room ?m ?r)
        (monster-afraid ?h ?m)
        (room-cleared ?h ?r)
    )
)

)

; problem
(define (problem pb1) (:domain dungeon)
(:objects
    player - hero
    m0 m1 - monster
    t0 - trap
    s0 - sword
    r0 r1 r2 r3 r4 r5 r6 r7 - room
)

(:init
    (hero-alive player)
    (hero-in-room player r0)
    (hero-empty-handed player)
    
    (monster-in-room m0 r2)
    (not (monster-afraid player m0))
    (monster-in-room m1 r3)
    (not (monster-afraid player m1))

    (trap-in-room t0 r5)
    (trap-armed t0 r5)
    (not (trap-disarmed t0 r5))

    (sword-in-room s0 r1)
    (not (sword-destroyed s0))
    (not (sword-holding player s0))

    (not (room-destroyed r0))
    (not (room-destroyed r1))
    (not (room-destroyed r2))
    (not (room-destroyed r3))
    (not (room-destroyed r4))
    (not (room-destroyed r5))
    (not (room-destroyed r6))
    (not (room-destroyed r7))

    (room-cleared player r0)
    (not (room-cleared player r1))
    (not (room-cleared player r2))
    (not (room-cleared player r3))
    (room-cleared player r4)
    (not (room-cleared player r5))
    (room-cleared player r6)
    (not (room-cleared player r7))

    (room-corridor r0 r1)
    (room-corridor r0 r2)
    (room-corridor r1 r0)
    (room-corridor r1 r2)
    (room-corridor r1 r3)
    (room-corridor r2 r0)
    (room-corridor r2 r1)
    (room-corridor r2 r4)
    (room-corridor r3 r1)
    (room-corridor r3 r4)
    (room-corridor r3 r5)
    (room-corridor r4 r2)
    (room-corridor r4 r3)
    (room-corridor r4 r7)
    (room-corridor r5 r3)
    (room-corridor r5 r6)
    (room-corridor r5 r7)
    (room-corridor r6 r4)
    (room-corridor r6 r5)
    (room-corridor r7 r6)
)
(:goal (and (hero-in-room player r7) (hero-alive player)))
)

; plan
1. (move player r0 r1)
   deleted: (hero-in-room player r0)
   added: (hero-in-room player r1) (room-destroyed r0)
   goals met: 1 of 2
2. (pickup-sword r1 player s0)
   deleted: (hero-empty-handed player) (sword-in-room s0 r1)
   added: (sword-holding player s0) (room-cleared player r1)
   goals met: 1 of 2
3. (move player r1 r3)
   deleted: (hero-in-room player r1)
   added: (hero-in-room player r3) (room-destroyed r1)
   goals met: 1 of 2
4. (face-monster player s0 r3 m1)
   added: (monster-afraid player m1) (room-cleared player r3)
   goals met: 1 of 2
5. (move player r3 r4)
   deleted: (hero-in-room player r3)
   added: (hero-in-room player r4) (room-destroyed r3)
   goals met: 1 of 2
6. (move player r4 r7)
   deleted: (hero-in-room player r4)
   added: (hero-in-room player r7) (room-destroyed r4)
   goals met: 2 of 2
